MCUdude/MiniCore/avr/svd/atmega328pb.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CFD</name>
      <description>No Description.</description>
      <baseAddress>0x00800062</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>XFDCSR</name>
          <description>XOSC Failure Detection Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFDIE</name>
              <description>Failure Detection Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XFDIF</name>
              <description>Failure Detection Interrupt Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>No Description.</description>
      <baseAddress>0x0080003E</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x19</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x23</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x26</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PCINT2</name>
        <description>Pin Change Interrupt Request 2</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPA</name>
        <description>Timer/Counter2 Compare Match A</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMPB</name>
        <description>Timer/Counter2 Compare Match B</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter1 Compare Match B</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>TimerCounter0 Compare Match A</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>TimerCounter0 Compare Match B</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>SPI0_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>USART0_RX</name>
        <description>USART0 Rx Complete</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0, Data Register Empty</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0 Tx Complete</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP</name>
        <description>Analog Comparator</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TWI0</name>
        <description>Two-wire Serial Interface</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>SPM_Ready</name>
        <description>Store Program Memory Read</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>USART0_START</name>
        <description>USART0 Start frame detection</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>PCINT3</name>
        <description>Pin Change Interrupt Request 3</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>USART1_RX</name>
        <description>USART1 Rx Complete</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>USART1_UDRE</name>
        <description>USART1, Data Register Empty</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>USART1_TX</name>
        <description>USART1 Tx Complete</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>USART1_START</name>
        <description>USART1 Start frame detection</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_CAPT</name>
        <description>Timer/Counter3 Capture Event</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPA</name>
        <description>Timer/Counter3 Compare Match A</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPB</name>
        <description>Timer/Counter3 Compare Match B</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_OVF</name>
        <description>Timer/Counter3 Overflow</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>CFD</name>
        <description>Clock failure detection interrupt</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>PTC_EOC</name>
        <description>PTC End of conversion</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>PTC_WCOMP</name>
        <description>PTC Window comparator mode</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>SPI1_STC</name>
        <description>SPI1 Serial Transfer Complete</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TWI1</name>
        <description>TWI Transfer Complete</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_CAPT</name>
        <description>Timer/Counter4 Capture Event</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_COMPA</name>
        <description>Timer/Counter4 Compare Match A</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_COMPB</name>
        <description>Timer/Counter4 Compare Match B</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>TIMER4_OVF</name>
        <description>Timer/Counter4 Overflow</description>
        <value>44</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose I/O Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose I/O Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose I/O Register 2</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>No Description.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODSE</name>
              <description>BOD Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODS</name>
              <description>BOD Sleep</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR0</name>
          <description>Power Reduction Register 0</description>
          <addressOffset>0x26</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART0</name>
              <description>Power Reduction USART0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI0</name>
              <description>Power Reduction Serial Peripheral Interface 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART1</name>
              <description>Power Reduction USART1</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM2</name>
              <description>Power Reduction Timer/Counter2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTWI0</name>
              <description>Power Reduction TWI0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR1</name>
          <description>Power Reduction Register 1</description>
          <addressOffset>0x27</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRTIM3</name>
              <description>Power Reduction Timer/Counter3</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI1</name>
              <description>Power Reduction Serial Peripheral Interface 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM4</name>
              <description>Power Reduction Timer/Counter4</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRPTC</name>
              <description>Power Reduction Peripheral Touch Controller</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTWI1</name>
              <description>Power Reduction TWI1</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>Sleep Mode Control Register</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select Bits</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSAVE</name>
                  <description>Power Save</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESTDBY</name>
                  <description>Extended Standby</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
